# vim:ft=ruby

if OS.mac?
    # taps
    #tap "homebrew/cask"
    #tap "homebrew/cask-fonts"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "kitty" # a better terminal emulator
    cask "imageoptim" # a tool to optimize images
    cask "1password/tap/1password-cli"
    cask "iterm2"
    cask "alfred"
    cask "rectangle"
    cask "alt-tab"
    cask "firefox-developer-edition"
    cask "app-cleaner"
    cask "android-file-transfer"
    cask "keepingyouawake"
    cask "discord"
    cask "vlc"
    cask "keka"
    cask "kap"
    cask "visual-studio-code"
    cask "insomnia"

    # Fonts

elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end


# packages
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "exa" # ls alternative
brew "fd" # find alternative
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "python" # python (latst)
brew "ripgrep" # very fast file searcher
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
